#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.api.kubernetes_deployment.api will be updated in-place
  ~ resource "kubernetes_deployment" "api" {
        id = "default/api"

        metadata {
            annotations      = {}
            generation       = 4
            labels           = {}
            name             = "api"
            namespace        = "default"
            resource_version = "1833415"
            self_link        = "/apis/apps/v1/namespaces/default/deployments/api"
            uid              = "d3557d8b-e6b2-494e-91c5-41e2f52e9214"
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "api"
                }
            }

            strategy {
                type = "RollingUpdate"

                rolling_update {
                    max_surge       = "25%"
                    max_unavailable = "25%"
                }
            }

          ~ template {
                metadata {
                    annotations = {}
                    generation  = 0
                    labels      = {
                        "app" = "api"
                    }
                }

              ~ spec {
                    active_deadline_seconds          = 0
                    automount_service_account_token  = false
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                    node_selector                    = {}
                    restart_policy                   = "Always"
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                    container {
                        args                     = []
                        command                  = []
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:8cb25a5039b144cf45ca824069b77253cad9016c"
                        image_pull_policy        = "Always"
                        name                     = "api"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                        env {
                            name = "DATABASE_URL"

                            value_from {

                                secret_key_ref {
                                    key  = "connection_string"
                                    name = "api-database-credentials"
                                }
                            }
                        }
                        env {
                            name  = "LANGUAGE_SERVICE_URL"
                            value = "http://language-service.default.svc.cluster.local:8000"
                        }
                        env {
                            name = "SECRET_KEY_BASE"

                            value_from {

                                secret_key_ref {
                                    key  = "secret_key_base"
                                    name = "api-secret-key-base"
                                }
                            }
                        }

                        liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                        port {
                            container_port = 4000
                            host_port      = 0
                            protocol       = "TCP"
                        }

                        readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                        resources {
                            limits {
                                memory = "500Mi"
                            }

                            requests {
                                memory = "100Mi"
                            }
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }

                  ~ init_container {
                        args                     = []
                        command                  = [
                            "bin/api",
                            "eval",
                            "'Api.Release.migrate'",
                        ]
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:latest"
                        image_pull_policy        = "Always"
                        name                     = "migrate-database"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "DATABASE_URL"

                            value_from {

                                secret_key_ref {
                                    key  = "connection_string"
                                    name = "api-database-credentials"
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "AUTH_TOKEN" -> "SECRET_KEY_BASE"
                          - value = "none" -> null

                          + value_from {

                              + secret_key_ref {
                                  + key  = "secret_key_base"
                                  + name = "api-secret-key-base"
                                }
                            }
                        }
                      ~ env {
                          ~ name  = "LANGUAGE_SERVICE_URL" -> "AUTH_TOKEN"
                            value = "none"
                        }
                      ~ env {
                          ~ name  = "SECRET_KEY_BASE" -> "LANGUAGE_SERVICE_URL"
                            value = "none"
                        }

                        resources {
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.content.helm_release.spark will be updated in-place
  ~ resource "helm_release" "spark" {
        atomic                     = false
      ~ chart                      = "spark" -> "sparkoperator"
        cleanup_on_fail            = false
        dependency_update          = false
        disable_crd_hooks          = false
      + disable_openapi_validation = false
        disable_webhooks           = false
        force_update               = false
        id                         = "spark"
        max_history                = 0
        metadata                   = [
            {
                chart     = "spark"
                name      = "spark"
                namespace = "content"
                revision  = 1
                values    = "null"
                version   = "1.2.10"
            },
        ]
        name                       = "spark"
        namespace                  = "content"
        recreate_pods              = false
        render_subchart_notes      = true
        replace                    = false
      ~ repository                 = "https://charts.bitnami.com/bitnami" -> "http://storage.googleapis.com/kubernetes-charts-incubator"
        reset_values               = false
        reuse_values               = false
        skip_crds                  = false
        status                     = "deployed"
        timeout                    = 300
        verify                     = false
      ~ version                    = "1.2.10" -> "0.6.9"
        wait                       = true
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
